import Paragraph from "@/app/_components/typography/Paragraph";
import SectionTitle from "@/app/_components/typography/SectionTitle";
import Title from "@/app/_components/typography/Title";
import Image from "next/image";
import React from "react";

const Intro = () => {
  return (
    <div className="space-y-4">
      <SectionTitle title="معرفی دوره" />
      <Paragraph justify>
        بدون شک در حال حاضر یکی از پرکاربردترین فریمورک‌های جاوا اسکریپتی که
        می‌توانید در دنیای وب پیدا بکنید React است. زمانی که یک فریمورک در
        زمینه‌های مختلف کاربرد داشته باشد نیز در نهایت باعث خواهد شد که فرصت‌های
        شغلی بسیار زیادی داشته باشد. اما آیا فکر می‌کنید برای قبول شدن در یک
        فرصت شغلی مناسب، تمام موارد لازم را در اختیار دارید؟ اگر حس می‌کنید در
        رابطه با این قضیه مطمئن نیستید و شک دارید، بهتر است با این دوره آموزشی
        همراه باشید.
      </Paragraph>
      <Title>دوره آموزشی پروژه محور react و next</Title>
      <Image
        className="rounded-3xl w-full"
        width={600}
        height={400}
        alt="poster"
        src={"/images/react.jpg"}
      />
      <Paragraph justify>
        زمانی که شما با موضوعات مختلف یک ابزار آشنایی پیدا کردید، یک نکته مهم که
        باید در نظر داشته باشید این است که چگونه با کنار هم قرار دادن ویژگی‌های
        مختلف خواهید توانست یک پروژه واقعی را ایجاد کنید. این موضوع دقیقا هدفی
        است که یک آموزش پروژه محور دنبال می‌کند. در یک آموزش پروژه محور در ابتدا
        شما به صورت مستقیم یا غیر مستقیم با مفاهیم اولیه آشنا شده و سپس فرایند
        یادگیری موضوعات جدید را در خلال ایجاد پروژه شروع خواهید کرد.
      </Paragraph>
      <Paragraph justify>
        منظور از غیر مستقیم بودن یادگیری مفاهیم اولیه این است که در برخی از
        وبسایت‌های آموزشی از جمله وبسایت آموزشی نابغه ما دوره‌های مقدماتی را
        پیشتر ضبط کرده و از شما انتظار داریم که ابتدا آن‌ها را به خوبی نگاه کرده
        و یاد گرفته باشید. به همین دلیل است که ما در پایان نوشته‌های مربوط به هر
        دوره یک قسمت اختصاصی به نام «پیش‌نیازها» را ایجاد کرده و در آنجا خواهیم
        گفت که برای یادگیری این دوره آموزشی نیاز خواهید داشت چه پیش‌نیازهایی را
        در ابتدا طی کنید.
      </Paragraph>
      <Title>ساختار دوره آموزشی پروژه محور React</Title>
      <Paragraph justify>
        در ساختار این دوره مانند دوره‌های آموزشی دیگر، ما از یک سرفصل‌بندی جامع
        و دقیق استفاده خواهیم کرد. در ادامه ما سعی می‌کنیم این ساختار را به صورت
        تمام و کمال به شما معرفی کنیم. هدف از انجام این کار نیز آشنایی هر چه
        بیشتر شما با این دوره آموزشی است. در اولین دوره این دوره نیز از ساختار
        دوره صحبت‌های بسیاری شده و می‌توانید از آن نیز استفاده کنید.
      </Paragraph>
    </div>
  );
};

export default Intro;
